Terraform plan for __production__
<details>
  <summary>Plan: 4 to add, 1 to change, 4 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.assumable_admin_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:SetSourceIdentity",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::657786969144:root"
                          + Service = []
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SSBAdmin"
      + path                  = "/"
      + tags                  = {
          + "Role" = "Admin"
        }
      + tags_all              = {
          + "Role" = "Admin"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.assumable_admin_role.aws_iam_role_policy_attachment.admin[0] will be created
  + resource "aws_iam_role_policy_attachment" "admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "SSBAdmin"
    }

  # module.assumable_poweruser_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:SetSourceIdentity",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::657786969144:root"
                          + Service = []
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SSBDev"
      + path                  = "/"
      + tags                  = {
          + "Role" = "PowerUser"
        }
      + tags_all              = {
          + "Role" = "PowerUser"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.assumable_poweruser_role.aws_iam_role_policy_attachment.poweruser[0] will be created
  + resource "aws_iam_role_policy_attachment" "poweruser" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/PowerUserAccess"
      + role       = "SSBDev"
    }

  # module.broker_solr.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ enable_ssh                 = true -> false
        id                         = "a4e266b7-6936-4f26-b9f2-b6decb99c5a1"
        name                       = "ssb-solr"
        # (19 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # module.iam_assumable_roles.aws_iam_role.admin[0] will be destroyed
  - resource "aws_iam_role" "admin" {
      - arn                   = "arn:aws:iam::821341638715:role/SSBAdmin" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Condition = {
                          - Bool            = {
                              - aws:MultiFactorAuthPresent = "true"
                            }
                          - NumericLessThan = {
                              - aws:MultiFactorAuthAge = "86400"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::657786969144:root"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-08-09T04:40:47Z" -> null
      - force_detach_policies = false -> null
      - id                    = "SSBAdmin" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "SSBAdmin" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA36O6G2A5W64ERMXIU" -> null

      - inline_policy {}
    }

  # module.iam_assumable_roles.aws_iam_role.poweruser[0] will be destroyed
  - resource "aws_iam_role" "poweruser" {
      - arn                   = "arn:aws:iam::821341638715:role/SSBDev" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Condition = {
                          - Bool            = {
                              - aws:MultiFactorAuthPresent = "true"
                            }
                          - NumericLessThan = {
                              - aws:MultiFactorAuthAge = "86400"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::657786969144:root"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-08-06T22:34:23Z" -> null
      - force_detach_policies = false -> null
      - id                    = "SSBDev" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/PowerUserAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "SSBDev" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA36O6G2A54UBOZSCRD" -> null

      - inline_policy {}
    }

  # module.iam_assumable_roles.aws_iam_role_policy_attachment.admin[0] will be destroyed
  - resource "aws_iam_role_policy_attachment" "admin" {
      - id         = "SSBAdmin-20210809044048777000000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
      - role       = "SSBAdmin" -> null
    }

  # module.iam_assumable_roles.aws_iam_role_policy_attachment.poweruser[0] will be destroyed
  - resource "aws_iam_role_policy_attachment" "poweruser" {
      - id         = "SSBDev-20210806223424375300000005" -> null
      - policy_arn = "arn:aws:iam::aws:policy/PowerUserAccess" -> null
      - role       = "SSBDev" -> null
    }

Plan: 4 to add, 1 to change, 4 to destroy.
```
</details>

Plan generated in [plan #117](https://github.com/GSA/datagov-ssb/actions/runs/1247579474)